Perfomance/reports/textSummary.txt

  /\      Grafana   /‾‾/
 /\  /  \     |\  __   /  /
/  \/    \    | |/ /  /   ‾‾\
/          \   |   (  |  (‾)  |
/ __________ \  |_|\_\  \_____/

  scenario: login_scenario (ramping-vus, max 140 VUs, ~60m)

  ====== RESUMEN DE REFERENCIA (corrida soak ~1h) ======

  checks.........................: 97.55%  269891 OK / 6759 KO
  data_received..................: 842 MB  223 kB/s
  data_sent......................: 588 MB  156 kB/s

  http_req_duration..............: avg=861.68ms  min=88ms  med=613.42ms  max=29.93s   p(90)=1.28s   p(95)=1.57s
  http_req_failed................: 2.44%   6759 out of 276650
  http_reqs......................: 276650  73.18/s

  iteration_duration.............: avg=1.86s    med=1.62s  max=31.2s    p(90)=2.31s   p(95)=2.57s
  iterations.....................: 276650  73.18/s
  vus............................: 1       min=0    max=140
  vus_max........................: 140

  ====== Desglose de errores por etapa ======
  Etapa 0 - HTTP 5xx ............: 1       0.000265/s
  Etapa 1 - HTTP 4xx ............: 769     0.203409/s
  Etapa 1 - HTTP 5xx ............: 5987    1.583625/s
  Etapa 2 - HTTP 5xx ............: 2       0.000529/s

  ====== Thresholds ======
  http_req_failed     'rate<0.03'      -> OK    (2.44% < 3%)
  http_reqs           'rate>20'        -> OK    (73.18 > 20 TPS)
  http_req_duration   'p(95)<1500'     -> FAIL  (1570ms >= 1500ms)